grevaillot/svd_tools/headers/STM32F3x4/hrtim_timd.h
/** HRTIM_TIMD_TIMDDIER5_DLYPRTDE DLYPRTDE **/
#define HRTIM_TIMD_TIMDDIER5_DLYPRTDE		(1 << 30)
/** HRTIM_TIMD_TIMDDIER5_RSTDE RSTDE **/
#define HRTIM_TIMD_TIMDDIER5_RSTDE		(1 << 29)
/** HRTIM_TIMD_TIMDDIER5_RSTx2DE RSTx2DE **/
#define HRTIM_TIMD_TIMDDIER5_RSTx2DE		(1 << 28)
/** HRTIM_TIMD_TIMDDIER5_SETx2DE SETx2DE **/
#define HRTIM_TIMD_TIMDDIER5_SETx2DE		(1 << 27)
/** HRTIM_TIMD_TIMDDIER5_RSTx1DE RSTx1DE **/
#define HRTIM_TIMD_TIMDDIER5_RSTx1DE		(1 << 26)
/** HRTIM_TIMD_TIMDDIER5_SET1xDE SET1xDE **/
#define HRTIM_TIMD_TIMDDIER5_SET1xDE		(1 << 25)
/** HRTIM_TIMD_TIMDDIER5_CPT2DE CPT2DE **/
#define HRTIM_TIMD_TIMDDIER5_CPT2DE		(1 << 24)
/** HRTIM_TIMD_TIMDDIER5_CPT1DE CPT1DE **/
#define HRTIM_TIMD_TIMDDIER5_CPT1DE		(1 << 23)
/** HRTIM_TIMD_TIMDDIER5_UPDDE UPDDE **/
#define HRTIM_TIMD_TIMDDIER5_UPDDE		(1 << 22)
/** HRTIM_TIMD_TIMDDIER5_REPDE REPDE **/
#define HRTIM_TIMD_TIMDDIER5_REPDE		(1 << 20)
/** HRTIM_TIMD_TIMDDIER5_CMP4DE CMP4DE **/
#define HRTIM_TIMD_TIMDDIER5_CMP4DE		(1 << 19)
/** HRTIM_TIMD_TIMDDIER5_CMP3DE CMP3DE **/
#define HRTIM_TIMD_TIMDDIER5_CMP3DE		(1 << 18)
/** HRTIM_TIMD_TIMDDIER5_CMP2DE CMP2DE **/
#define HRTIM_TIMD_TIMDDIER5_CMP2DE		(1 << 17)
/** HRTIM_TIMD_TIMDDIER5_CMP1DE CMP1DE **/
#define HRTIM_TIMD_TIMDDIER5_CMP1DE		(1 << 16)
/** HRTIM_TIMD_TIMDDIER5_DLYPRTIE DLYPRTIE **/
#define HRTIM_TIMD_TIMDDIER5_DLYPRTIE		(1 << 14)
/** HRTIM_TIMD_TIMDDIER5_RSTIE RSTIE **/
#define HRTIM_TIMD_TIMDDIER5_RSTIE		(1 << 13)
/** HRTIM_TIMD_TIMDDIER5_RSTx2IE RSTx2IE **/
#define HRTIM_TIMD_TIMDDIER5_RSTx2IE		(1 << 12)
/** HRTIM_TIMD_TIMDDIER5_SETx2IE SETx2IE **/
#define HRTIM_TIMD_TIMDDIER5_SETx2IE		(1 << 11)
/** HRTIM_TIMD_TIMDDIER5_RSTx1IE RSTx1IE **/
#define HRTIM_TIMD_TIMDDIER5_RSTx1IE		(1 << 10)
/** HRTIM_TIMD_TIMDDIER5_SET1xIE SET1xIE **/
#define HRTIM_TIMD_TIMDDIER5_SET1xIE		(1 << 9)
/** HRTIM_TIMD_TIMDDIER5_CPT2IE CPT2IE **/
#define HRTIM_TIMD_TIMDDIER5_CPT2IE		(1 << 8)
/** HRTIM_TIMD_TIMDDIER5_CPT1IE CPT1IE **/
#define HRTIM_TIMD_TIMDDIER5_CPT1IE		(1 << 7)
/** HRTIM_TIMD_TIMDDIER5_UPDIE UPDIE **/
#define HRTIM_TIMD_TIMDDIER5_UPDIE		(1 << 6)
/** HRTIM_TIMD_TIMDDIER5_REPIE REPIE **/
#define HRTIM_TIMD_TIMDDIER5_REPIE		(1 << 4)
/** HRTIM_TIMD_TIMDDIER5_CMP4IE CMP4IE **/
#define HRTIM_TIMD_TIMDDIER5_CMP4IE		(1 << 3)
/** HRTIM_TIMD_TIMDDIER5_CMP3IE CMP3IE **/
#define HRTIM_TIMD_TIMDDIER5_CMP3IE		(1 << 2)
/** HRTIM_TIMD_TIMDDIER5_CMP2IE CMP2IE **/
#define HRTIM_TIMD_TIMDDIER5_CMP2IE		(1 << 1)
/** HRTIM_TIMD_TIMDDIER5_CMP1IE CMP1IE **/
#define HRTIM_TIMD_TIMDDIER5_CMP1IE		(1 << 0)

/**@}*/

/** @defgroup hrtim_timd_cntdr CNTDR Timerx Counter Register
@{*/


#define HRTIM_TIMD_CNTDR_CNTx_SHIFT		0
#define HRTIM_TIMD_CNTDR_CNTx_MASK		0xffff
/** @defgroup hrtim_timd_cntdr_cntx CNTx Timerx Counter value
@{*/
/**@}*/


/**@}*/

/** @defgroup hrtim_timd_perdr PERDR Timerx Period Register
@{*/


#define HRTIM_TIMD_PERDR_PERx_SHIFT		0
#define HRTIM_TIMD_PERDR_PERx_MASK		0xffff
/** @defgroup hrtim_timd_perdr_perx PERx Timerx Period value
@{*/
/**@}*/


/**@}*/

/** @defgroup hrtim_timd_repdr REPDR Timerx Repetition Register
@{*/


#define HRTIM_TIMD_REPDR_REPx_SHIFT		0
#define HRTIM_TIMD_REPDR_REPx_MASK		0xff
/** @defgroup hrtim_timd_repdr_repx REPx Timerx Repetition counter value
@{*/
/**@}*/


/**@}*/

/** @defgroup hrtim_timd_cmp1dr CMP1DR Timerx Compare 1 Register
@{*/


#define HRTIM_TIMD_CMP1DR_CMP1x_SHIFT		0
#define HRTIM_TIMD_CMP1DR_CMP1x_MASK		0xffff
/** @defgroup hrtim_timd_cmp1dr_cmp1x CMP1x Timerx Compare 1 value
@{*/
/**@}*/


/**@}*/

/** @defgroup hrtim_timd_cmp1cdr CMP1CDR Timerx Compare 1 Compound Register
@{*/


#define HRTIM_TIMD_CMP1CDR_REPx_SHIFT		16
#define HRTIM_TIMD_CMP1CDR_REPx_MASK		0xff
/** @defgroup hrtim_timd_cmp1cdr_repx REPx Timerx Repetition value (aliased from HRTIM_REPx register)
@{*/
/**@}*/


#define HRTIM_TIMD_CMP1CDR_CMP1x_SHIFT		0
#define HRTIM_TIMD_CMP1CDR_CMP1x_MASK		0xffff
/** @defgroup hrtim_timd_cmp1cdr_cmp1x CMP1x Timerx Compare 1 value
@{*/
/**@}*/


/**@}*/

/** @defgroup hrtim_timd_cmp2dr CMP2DR Timerx Compare 2 Register
@{*/


#define HRTIM_TIMD_CMP2DR_CMP2x_SHIFT		0
#define HRTIM_TIMD_CMP2DR_CMP2x_MASK		0xffff
/** @defgroup hrtim_timd_cmp2dr_cmp2x CMP2x Timerx Compare 2 value
@{*/
/**@}*/


/**@}*/

/** @defgroup hrtim_timd_cmp3dr CMP3DR Timerx Compare 3 Register
@{*/


#define HRTIM_TIMD_CMP3DR_CMP3x_SHIFT		0
#define HRTIM_TIMD_CMP3DR_CMP3x_MASK		0xffff
/** @defgroup hrtim_timd_cmp3dr_cmp3x CMP3x Timerx Compare 3 value
@{*/
/**@}*/


/**@}*/

/** @defgroup hrtim_timd_cmp4dr CMP4DR Timerx Compare 4 Register
@{*/


#define HRTIM_TIMD_CMP4DR_CMP4x_SHIFT		0
#define HRTIM_TIMD_CMP4DR_CMP4x_MASK		0xffff
/** @defgroup hrtim_timd_cmp4dr_cmp4x CMP4x Timerx Compare 4 value
@{*/
/**@}*/


/**@}*/

/** @defgroup hrtim_timd_cpt1dr CPT1DR Timerx Capture 1 Register
@{*/


#define HRTIM_TIMD_CPT1DR_CPT1x_SHIFT		0
#define HRTIM_TIMD_CPT1DR_CPT1x_MASK		0xffff
/** @defgroup hrtim_timd_cpt1dr_cpt1x CPT1x Timerx Capture 1 value
@{*/
/**@}*/


/**@}*/

/** @defgroup hrtim_timd_cpt2dr CPT2DR Timerx Capture 2 Register
@{*/


#define HRTIM_TIMD_CPT2DR_CPT2x_SHIFT		0
#define HRTIM_TIMD_CPT2DR_CPT2x_MASK		0xffff
/** @defgroup hrtim_timd_cpt2dr_cpt2x CPT2x Timerx Capture 2 value
@{*/
/**@}*/


/**@}*/

/** @defgroup hrtim_timd_dtdr DTDR Timerx Deadtime Register
@{*/

/** HRTIM_TIMD_DTDR_DTFLKx Deadtime Falling Lock **/
#define HRTIM_TIMD_DTDR_DTFLKx		(1 << 31)
/** HRTIM_TIMD_DTDR_DTFSLKx Deadtime Falling Sign Lock **/
#define HRTIM_TIMD_DTDR_DTFSLKx		(1 << 30)
/** HRTIM_TIMD_DTDR_SDTFx Sign Deadtime Falling value **/
#define HRTIM_TIMD_DTDR_SDTFx		(1 << 25)

#define HRTIM_TIMD_DTDR_DTFx_SHIFT		16
#define HRTIM_TIMD_DTDR_DTFx_MASK		0x1ff
/** @defgroup hrtim_timd_dtdr_dtfx DTFx Deadtime Falling value
@{*/
/**@}*/

/** HRTIM_TIMD_DTDR_DTRLKx Deadtime Rising Lock **/
#define HRTIM_TIMD_DTDR_DTRLKx		(1 << 15)
/** HRTIM_TIMD_DTDR_DTRSLKx Deadtime Rising Sign Lock **/
#define HRTIM_TIMD_DTDR_DTRSLKx		(1 << 14)

#define HRTIM_TIMD_DTDR_DTPRSC_SHIFT		10
#define HRTIM_TIMD_DTDR_DTPRSC_MASK		0x07
/** @defgroup hrtim_timd_dtdr_dtprsc DTPRSC Deadtime Prescaler
@{*/
/**@}*/

/** HRTIM_TIMD_DTDR_SDTRx Sign Deadtime Rising value **/
#define HRTIM_TIMD_DTDR_SDTRx		(1 << 9)

#define HRTIM_TIMD_DTDR_DTRx_SHIFT		0
#define HRTIM_TIMD_DTDR_DTRx_MASK		0x1ff
/** @defgroup hrtim_timd_dtdr_dtrx DTRx Deadtime Rising value
@{*/
/**@}*/


/**@}*/

