grevaillot/svd_tools/headers/STM32F3x4/hrtim_timd.h
/** @defgroup hrtim_timd_setd1r SETD1R Timerx Output1 Set Register
@{*/

/** HRTIM_TIMD_SETD1R_UPDATE Registers update (transfer preload to active) **/
#define HRTIM_TIMD_SETD1R_UPDATE		(1 << 31)
/** HRTIM_TIMD_SETD1R_EXTEVNT10 External Event 10 **/
#define HRTIM_TIMD_SETD1R_EXTEVNT10		(1 << 30)
/** HRTIM_TIMD_SETD1R_EXTEVNT9 External Event 9 **/
#define HRTIM_TIMD_SETD1R_EXTEVNT9		(1 << 29)
/** HRTIM_TIMD_SETD1R_EXTEVNT8 External Event 8 **/
#define HRTIM_TIMD_SETD1R_EXTEVNT8		(1 << 28)
/** HRTIM_TIMD_SETD1R_EXTEVNT7 External Event 7 **/
#define HRTIM_TIMD_SETD1R_EXTEVNT7		(1 << 27)
/** HRTIM_TIMD_SETD1R_EXTEVNT6 External Event 6 **/
#define HRTIM_TIMD_SETD1R_EXTEVNT6		(1 << 26)
/** HRTIM_TIMD_SETD1R_EXTEVNT5 External Event 5 **/
#define HRTIM_TIMD_SETD1R_EXTEVNT5		(1 << 25)
/** HRTIM_TIMD_SETD1R_EXTEVNT4 External Event 4 **/
#define HRTIM_TIMD_SETD1R_EXTEVNT4		(1 << 24)
/** HRTIM_TIMD_SETD1R_EXTEVNT3 External Event 3 **/
#define HRTIM_TIMD_SETD1R_EXTEVNT3		(1 << 23)
/** HRTIM_TIMD_SETD1R_EXTEVNT2 External Event 2 **/
#define HRTIM_TIMD_SETD1R_EXTEVNT2		(1 << 22)
/** HRTIM_TIMD_SETD1R_EXTEVNT1 External Event 1 **/
#define HRTIM_TIMD_SETD1R_EXTEVNT1		(1 << 21)
/** HRTIM_TIMD_SETD1R_TIMEVNT9 Timer Event 9 **/
#define HRTIM_TIMD_SETD1R_TIMEVNT9		(1 << 20)
/** HRTIM_TIMD_SETD1R_TIMEVNT8 Timer Event 8 **/
#define HRTIM_TIMD_SETD1R_TIMEVNT8		(1 << 19)
/** HRTIM_TIMD_SETD1R_TIMEVNT7 Timer Event 7 **/
#define HRTIM_TIMD_SETD1R_TIMEVNT7		(1 << 18)
/** HRTIM_TIMD_SETD1R_TIMEVNT6 Timer Event 6 **/
#define HRTIM_TIMD_SETD1R_TIMEVNT6		(1 << 17)
/** HRTIM_TIMD_SETD1R_TIMEVNT5 Timer Event 5 **/
#define HRTIM_TIMD_SETD1R_TIMEVNT5		(1 << 16)
/** HRTIM_TIMD_SETD1R_TIMEVNT4 Timer Event 4 **/
#define HRTIM_TIMD_SETD1R_TIMEVNT4		(1 << 15)
/** HRTIM_TIMD_SETD1R_TIMEVNT3 Timer Event 3 **/
#define HRTIM_TIMD_SETD1R_TIMEVNT3		(1 << 14)
/** HRTIM_TIMD_SETD1R_TIMEVNT2 Timer Event 2 **/
#define HRTIM_TIMD_SETD1R_TIMEVNT2		(1 << 13)
/** HRTIM_TIMD_SETD1R_TIMEVNT1 Timer Event 1 **/
#define HRTIM_TIMD_SETD1R_TIMEVNT1		(1 << 12)
/** HRTIM_TIMD_SETD1R_MSTCMP4 Master Compare 4 **/
#define HRTIM_TIMD_SETD1R_MSTCMP4		(1 << 11)
/** HRTIM_TIMD_SETD1R_MSTCMP3 Master Compare 3 **/
#define HRTIM_TIMD_SETD1R_MSTCMP3		(1 << 10)
/** HRTIM_TIMD_SETD1R_MSTCMP2 Master Compare 2 **/
#define HRTIM_TIMD_SETD1R_MSTCMP2		(1 << 9)
/** HRTIM_TIMD_SETD1R_MSTCMP1 Master Compare 1 **/
#define HRTIM_TIMD_SETD1R_MSTCMP1		(1 << 8)
/** HRTIM_TIMD_SETD1R_MSTPER Master Period **/
#define HRTIM_TIMD_SETD1R_MSTPER		(1 << 7)
/** HRTIM_TIMD_SETD1R_CMP4 Timer A compare 4 **/
#define HRTIM_TIMD_SETD1R_CMP4		(1 << 6)
/** HRTIM_TIMD_SETD1R_CMP3 Timer A compare 3 **/
#define HRTIM_TIMD_SETD1R_CMP3		(1 << 5)
/** HRTIM_TIMD_SETD1R_CMP2 Timer A compare 2 **/
#define HRTIM_TIMD_SETD1R_CMP2		(1 << 4)
/** HRTIM_TIMD_SETD1R_CMP1 Timer A compare 1 **/
#define HRTIM_TIMD_SETD1R_CMP1		(1 << 3)
/** HRTIM_TIMD_SETD1R_PER Timer A Period **/
#define HRTIM_TIMD_SETD1R_PER		(1 << 2)
/** HRTIM_TIMD_SETD1R_RESYNC Timer A resynchronizaton **/
#define HRTIM_TIMD_SETD1R_RESYNC		(1 << 1)
/** HRTIM_TIMD_SETD1R_SST Software Set trigger **/
#define HRTIM_TIMD_SETD1R_SST		(1 << 0)

/**@}*/

/** @defgroup hrtim_timd_rstd1r RSTD1R Timerx Output1 Reset Register
@{*/

/** HRTIM_TIMD_RSTD1R_UPDATE UPDATE **/
#define HRTIM_TIMD_RSTD1R_UPDATE		(1 << 31)
/** HRTIM_TIMD_RSTD1R_EXTEVNT10 EXTEVNT10 **/
#define HRTIM_TIMD_RSTD1R_EXTEVNT10		(1 << 30)
/** HRTIM_TIMD_RSTD1R_EXTEVNT9 EXTEVNT9 **/
#define HRTIM_TIMD_RSTD1R_EXTEVNT9		(1 << 29)
/** HRTIM_TIMD_RSTD1R_EXTEVNT8 EXTEVNT8 **/
#define HRTIM_TIMD_RSTD1R_EXTEVNT8		(1 << 28)
/** HRTIM_TIMD_RSTD1R_EXTEVNT7 EXTEVNT7 **/
#define HRTIM_TIMD_RSTD1R_EXTEVNT7		(1 << 27)
/** HRTIM_TIMD_RSTD1R_EXTEVNT6 EXTEVNT6 **/
#define HRTIM_TIMD_RSTD1R_EXTEVNT6		(1 << 26)
/** HRTIM_TIMD_RSTD1R_EXTEVNT5 EXTEVNT5 **/
#define HRTIM_TIMD_RSTD1R_EXTEVNT5		(1 << 25)
/** HRTIM_TIMD_RSTD1R_EXTEVNT4 EXTEVNT4 **/
#define HRTIM_TIMD_RSTD1R_EXTEVNT4		(1 << 24)
/** HRTIM_TIMD_RSTD1R_EXTEVNT3 EXTEVNT3 **/
#define HRTIM_TIMD_RSTD1R_EXTEVNT3		(1 << 23)
/** HRTIM_TIMD_RSTD1R_EXTEVNT2 EXTEVNT2 **/
#define HRTIM_TIMD_RSTD1R_EXTEVNT2		(1 << 22)
/** HRTIM_TIMD_RSTD1R_EXTEVNT1 EXTEVNT1 **/
#define HRTIM_TIMD_RSTD1R_EXTEVNT1		(1 << 21)
/** HRTIM_TIMD_RSTD1R_TIMEVNT9 TIMEVNT9 **/
#define HRTIM_TIMD_RSTD1R_TIMEVNT9		(1 << 20)
/** HRTIM_TIMD_RSTD1R_TIMEVNT8 TIMEVNT8 **/
#define HRTIM_TIMD_RSTD1R_TIMEVNT8		(1 << 19)
/** HRTIM_TIMD_RSTD1R_TIMEVNT7 TIMEVNT7 **/
#define HRTIM_TIMD_RSTD1R_TIMEVNT7		(1 << 18)
/** HRTIM_TIMD_RSTD1R_TIMEVNT6 TIMEVNT6 **/
#define HRTIM_TIMD_RSTD1R_TIMEVNT6		(1 << 17)
/** HRTIM_TIMD_RSTD1R_TIMEVNT5 TIMEVNT5 **/
#define HRTIM_TIMD_RSTD1R_TIMEVNT5		(1 << 16)
/** HRTIM_TIMD_RSTD1R_TIMEVNT4 TIMEVNT4 **/
#define HRTIM_TIMD_RSTD1R_TIMEVNT4		(1 << 15)
/** HRTIM_TIMD_RSTD1R_TIMEVNT3 TIMEVNT3 **/
#define HRTIM_TIMD_RSTD1R_TIMEVNT3		(1 << 14)
/** HRTIM_TIMD_RSTD1R_TIMEVNT2 TIMEVNT2 **/
#define HRTIM_TIMD_RSTD1R_TIMEVNT2		(1 << 13)
/** HRTIM_TIMD_RSTD1R_TIMEVNT1 TIMEVNT1 **/
#define HRTIM_TIMD_RSTD1R_TIMEVNT1		(1 << 12)
/** HRTIM_TIMD_RSTD1R_MSTCMP4 MSTCMP4 **/
#define HRTIM_TIMD_RSTD1R_MSTCMP4		(1 << 11)
/** HRTIM_TIMD_RSTD1R_MSTCMP3 MSTCMP3 **/
#define HRTIM_TIMD_RSTD1R_MSTCMP3		(1 << 10)
/** HRTIM_TIMD_RSTD1R_MSTCMP2 MSTCMP2 **/
#define HRTIM_TIMD_RSTD1R_MSTCMP2		(1 << 9)
/** HRTIM_TIMD_RSTD1R_MSTCMP1 MSTCMP1 **/
#define HRTIM_TIMD_RSTD1R_MSTCMP1		(1 << 8)
/** HRTIM_TIMD_RSTD1R_MSTPER MSTPER **/
#define HRTIM_TIMD_RSTD1R_MSTPER		(1 << 7)
/** HRTIM_TIMD_RSTD1R_CMP4 CMP4 **/
#define HRTIM_TIMD_RSTD1R_CMP4		(1 << 6)
/** HRTIM_TIMD_RSTD1R_CMP3 CMP3 **/
#define HRTIM_TIMD_RSTD1R_CMP3		(1 << 5)
/** HRTIM_TIMD_RSTD1R_CMP2 CMP2 **/
#define HRTIM_TIMD_RSTD1R_CMP2		(1 << 4)
/** HRTIM_TIMD_RSTD1R_CMP1 CMP1 **/
#define HRTIM_TIMD_RSTD1R_CMP1		(1 << 3)
/** HRTIM_TIMD_RSTD1R_PER PER **/
#define HRTIM_TIMD_RSTD1R_PER		(1 << 2)
/** HRTIM_TIMD_RSTD1R_RESYNC RESYNC **/
#define HRTIM_TIMD_RSTD1R_RESYNC		(1 << 1)
/** HRTIM_TIMD_RSTD1R_SRT SRT **/
#define HRTIM_TIMD_RSTD1R_SRT		(1 << 0)

/**@}*/

/** @defgroup hrtim_timd_setd2r SETD2R Timerx Output2 Set Register
@{*/

