grevaillot/svd_tools/headers/STM32F3x4/hrtim_timd.h
/** HRTIM_TIMD_EEFDR1_EE3LTCH External Event 3 latch **/
#define HRTIM_TIMD_EEFDR1_EE3LTCH		(1 << 12)

#define HRTIM_TIMD_EEFDR1_EE2FLTR_SHIFT		7
#define HRTIM_TIMD_EEFDR1_EE2FLTR_MASK		0x0f
/** @defgroup hrtim_timd_eefdr1_ee2fltr EE2FLTR External Event 2 filter
@{*/
/**@}*/

/** HRTIM_TIMD_EEFDR1_EE2LTCH External Event 2 latch **/
#define HRTIM_TIMD_EEFDR1_EE2LTCH		(1 << 6)

#define HRTIM_TIMD_EEFDR1_EE1FLTR_SHIFT		1
#define HRTIM_TIMD_EEFDR1_EE1FLTR_MASK		0x0f
/** @defgroup hrtim_timd_eefdr1_ee1fltr EE1FLTR External Event 1 filter
@{*/
/**@}*/

/** HRTIM_TIMD_EEFDR1_EE1LTCH External Event 1 latch **/
#define HRTIM_TIMD_EEFDR1_EE1LTCH		(1 << 0)

/**@}*/

/** @defgroup hrtim_timd_eefdr2 EEFDR2 Timerx External Event Filtering Register 2
@{*/


#define HRTIM_TIMD_EEFDR2_EE10FLTR_SHIFT		25
#define HRTIM_TIMD_EEFDR2_EE10FLTR_MASK		0x0f
/** @defgroup hrtim_timd_eefdr2_ee10fltr EE10FLTR External Event 10 filter
@{*/
/**@}*/

/** HRTIM_TIMD_EEFDR2_EE10LTCH External Event 10 latch **/
#define HRTIM_TIMD_EEFDR2_EE10LTCH		(1 << 24)

#define HRTIM_TIMD_EEFDR2_EE9FLTR_SHIFT		19
#define HRTIM_TIMD_EEFDR2_EE9FLTR_MASK		0x0f
/** @defgroup hrtim_timd_eefdr2_ee9fltr EE9FLTR External Event 9 filter
@{*/
/**@}*/

/** HRTIM_TIMD_EEFDR2_EE9LTCH External Event 9 latch **/
#define HRTIM_TIMD_EEFDR2_EE9LTCH		(1 << 18)

#define HRTIM_TIMD_EEFDR2_EE8FLTR_SHIFT		13
#define HRTIM_TIMD_EEFDR2_EE8FLTR_MASK		0x0f
/** @defgroup hrtim_timd_eefdr2_ee8fltr EE8FLTR External Event 8 filter
@{*/
/**@}*/

/** HRTIM_TIMD_EEFDR2_EE8LTCH External Event 8 latch **/
#define HRTIM_TIMD_EEFDR2_EE8LTCH		(1 << 12)

#define HRTIM_TIMD_EEFDR2_EE7FLTR_SHIFT		7
#define HRTIM_TIMD_EEFDR2_EE7FLTR_MASK		0x0f
/** @defgroup hrtim_timd_eefdr2_ee7fltr EE7FLTR External Event 7 filter
@{*/
/**@}*/

/** HRTIM_TIMD_EEFDR2_EE7LTCH External Event 7 latch **/
#define HRTIM_TIMD_EEFDR2_EE7LTCH		(1 << 6)

#define HRTIM_TIMD_EEFDR2_EE6FLTR_SHIFT		1
#define HRTIM_TIMD_EEFDR2_EE6FLTR_MASK		0x0f
/** @defgroup hrtim_timd_eefdr2_ee6fltr EE6FLTR External Event 6 filter
@{*/
/**@}*/

/** HRTIM_TIMD_EEFDR2_EE6LTCH External Event 6 latch **/
#define HRTIM_TIMD_EEFDR2_EE6LTCH		(1 << 0)

/**@}*/

/** @defgroup hrtim_timd_rstdr RSTDR TimerA Reset Register
@{*/

/** HRTIM_TIMD_RSTDR_TIMECMP4 Timer E Compare 4 **/
#define HRTIM_TIMD_RSTDR_TIMECMP4		(1 << 30)
/** HRTIM_TIMD_RSTDR_TIMECMP2 Timer E Compare 2 **/
#define HRTIM_TIMD_RSTDR_TIMECMP2		(1 << 29)
/** HRTIM_TIMD_RSTDR_TIMECMP1 Timer E Compare 1 **/
#define HRTIM_TIMD_RSTDR_TIMECMP1		(1 << 28)
/** HRTIM_TIMD_RSTDR_TIMCCMP4 Timer C Compare 4 **/
#define HRTIM_TIMD_RSTDR_TIMCCMP4		(1 << 27)
/** HRTIM_TIMD_RSTDR_TIMCCMP2 Timer C Compare 2 **/
#define HRTIM_TIMD_RSTDR_TIMCCMP2		(1 << 26)
/** HRTIM_TIMD_RSTDR_TIMCCMP1 Timer C Compare 1 **/
#define HRTIM_TIMD_RSTDR_TIMCCMP1		(1 << 25)
/** HRTIM_TIMD_RSTDR_TIMBCMP4 Timer B Compare 4 **/
#define HRTIM_TIMD_RSTDR_TIMBCMP4		(1 << 24)
/** HRTIM_TIMD_RSTDR_TIMBCMP2 Timer B Compare 2 **/
#define HRTIM_TIMD_RSTDR_TIMBCMP2		(1 << 23)
/** HRTIM_TIMD_RSTDR_TIMBCMP1 Timer B Compare 1 **/
#define HRTIM_TIMD_RSTDR_TIMBCMP1		(1 << 22)
/** HRTIM_TIMD_RSTDR_TIMACMP4 Timer A Compare 4 **/
#define HRTIM_TIMD_RSTDR_TIMACMP4		(1 << 21)
/** HRTIM_TIMD_RSTDR_TIMACMP2 Timer A Compare 2 **/
#define HRTIM_TIMD_RSTDR_TIMACMP2		(1 << 20)
/** HRTIM_TIMD_RSTDR_TIMACMP1 Timer A Compare 1 **/
#define HRTIM_TIMD_RSTDR_TIMACMP1		(1 << 19)
/** HRTIM_TIMD_RSTDR_EXTEVNT10 External Event 10 **/
#define HRTIM_TIMD_RSTDR_EXTEVNT10		(1 << 18)
/** HRTIM_TIMD_RSTDR_EXTEVNT9 External Event 9 **/
#define HRTIM_TIMD_RSTDR_EXTEVNT9		(1 << 17)
/** HRTIM_TIMD_RSTDR_EXTEVNT8 External Event 8 **/
#define HRTIM_TIMD_RSTDR_EXTEVNT8		(1 << 16)
/** HRTIM_TIMD_RSTDR_EXTEVNT7 External Event 7 **/
#define HRTIM_TIMD_RSTDR_EXTEVNT7		(1 << 15)
/** HRTIM_TIMD_RSTDR_EXTEVNT6 External Event 6 **/
#define HRTIM_TIMD_RSTDR_EXTEVNT6		(1 << 14)
/** HRTIM_TIMD_RSTDR_EXTEVNT5 External Event 5 **/
#define HRTIM_TIMD_RSTDR_EXTEVNT5		(1 << 13)
/** HRTIM_TIMD_RSTDR_EXTEVNT4 External Event 4 **/
#define HRTIM_TIMD_RSTDR_EXTEVNT4		(1 << 12)
/** HRTIM_TIMD_RSTDR_EXTEVNT3 External Event 3 **/
#define HRTIM_TIMD_RSTDR_EXTEVNT3		(1 << 11)
/** HRTIM_TIMD_RSTDR_EXTEVNT2 External Event 2 **/
#define HRTIM_TIMD_RSTDR_EXTEVNT2		(1 << 10)
/** HRTIM_TIMD_RSTDR_EXTEVNT1 External Event 1 **/
#define HRTIM_TIMD_RSTDR_EXTEVNT1		(1 << 9)
/** HRTIM_TIMD_RSTDR_MSTCMP4 Master compare 4 **/
#define HRTIM_TIMD_RSTDR_MSTCMP4		(1 << 8)
/** HRTIM_TIMD_RSTDR_MSTCMP3 Master compare 3 **/
#define HRTIM_TIMD_RSTDR_MSTCMP3		(1 << 7)
/** HRTIM_TIMD_RSTDR_MSTCMP2 Master compare 2 **/
#define HRTIM_TIMD_RSTDR_MSTCMP2		(1 << 6)
/** HRTIM_TIMD_RSTDR_MSTCMP1 Master compare 1 **/
#define HRTIM_TIMD_RSTDR_MSTCMP1		(1 << 5)
/** HRTIM_TIMD_RSTDR_MSTPER Master timer Period **/
#define HRTIM_TIMD_RSTDR_MSTPER		(1 << 4)
/** HRTIM_TIMD_RSTDR_CMP4 Timer A compare 4 reset **/
#define HRTIM_TIMD_RSTDR_CMP4		(1 << 3)
/** HRTIM_TIMD_RSTDR_CMP2 Timer A compare 2 reset **/
#define HRTIM_TIMD_RSTDR_CMP2		(1 << 2)
/** HRTIM_TIMD_RSTDR_UPDT Timer A Update reset **/
#define HRTIM_TIMD_RSTDR_UPDT		(1 << 1)

/**@}*/

/** @defgroup hrtim_timd_chpdr CHPDR Timerx Chopper Register
@{*/


#define HRTIM_TIMD_CHPDR_STRTPW_SHIFT		7
#define HRTIM_TIMD_CHPDR_STRTPW_MASK		0x0f
/** @defgroup hrtim_timd_chpdr_strtpw STRTPW STRTPW
@{*/
/**@}*/


#define HRTIM_TIMD_CHPDR_CHPDTY_SHIFT		4
#define HRTIM_TIMD_CHPDR_CHPDTY_MASK		0x07
/** @defgroup hrtim_timd_chpdr_chpdty CHPDTY Timerx chopper duty cycle value
@{*/
/**@}*/


#define HRTIM_TIMD_CHPDR_CHPFRQ_SHIFT		0
#define HRTIM_TIMD_CHPDR_CHPFRQ_MASK		0x0f
/** @defgroup hrtim_timd_chpdr_chpfrq CHPFRQ Timerx carrier frequency value
@{*/
/**@}*/


/**@}*/

/** @defgroup hrtim_timd_cpt1dcr CPT1DCR Timerx Capture 2 Control Register
@{*/

/** HRTIM_TIMD_CPT1DCR_TECMP2 Timer E Compare 2 **/
#define HRTIM_TIMD_CPT1DCR_TECMP2		(1 << 31)
/** HRTIM_TIMD_CPT1DCR_TECMP1 Timer E Compare 1 **/
#define HRTIM_TIMD_CPT1DCR_TECMP1		(1 << 30)
/** HRTIM_TIMD_CPT1DCR_TE1RST Timer E output 1 Reset **/
#define HRTIM_TIMD_CPT1DCR_TE1RST		(1 << 29)
/** HRTIM_TIMD_CPT1DCR_TE1SET Timer E output 1 Set **/
#define HRTIM_TIMD_CPT1DCR_TE1SET		(1 << 28)
/** HRTIM_TIMD_CPT1DCR_TCCMP2 Timer C Compare 2 **/
#define HRTIM_TIMD_CPT1DCR_TCCMP2		(1 << 23)
/** HRTIM_TIMD_CPT1DCR_TCCMP1 Timer C Compare 1 **/
#define HRTIM_TIMD_CPT1DCR_TCCMP1		(1 << 22)
/** HRTIM_TIMD_CPT1DCR_TC1RST Timer C output 1 Reset **/
#define HRTIM_TIMD_CPT1DCR_TC1RST		(1 << 21)
/** HRTIM_TIMD_CPT1DCR_TC1SET Timer C output 1 Set **/
#define HRTIM_TIMD_CPT1DCR_TC1SET		(1 << 20)
/** HRTIM_TIMD_CPT1DCR_TBCMP2 Timer B Compare 2 **/
#define HRTIM_TIMD_CPT1DCR_TBCMP2		(1 << 19)
/** HRTIM_TIMD_CPT1DCR_TBCMP1 Timer B Compare 1 **/
#define HRTIM_TIMD_CPT1DCR_TBCMP1		(1 << 18)
/** HRTIM_TIMD_CPT1DCR_TB1RST Timer B output 1 Reset **/
#define HRTIM_TIMD_CPT1DCR_TB1RST		(1 << 17)
/** HRTIM_TIMD_CPT1DCR_TB1SET Timer B output 1 Set **/
#define HRTIM_TIMD_CPT1DCR_TB1SET		(1 << 16)
/** HRTIM_TIMD_CPT1DCR_TACMP2 Timer A Compare 2 **/
#define HRTIM_TIMD_CPT1DCR_TACMP2		(1 << 15)
/** HRTIM_TIMD_CPT1DCR_TACMP1 Timer A Compare 1 **/
#define HRTIM_TIMD_CPT1DCR_TACMP1		(1 << 14)
/** HRTIM_TIMD_CPT1DCR_TA1RST Timer A output 1 Reset **/
#define HRTIM_TIMD_CPT1DCR_TA1RST		(1 << 13)
/** HRTIM_TIMD_CPT1DCR_TA1SET Timer A output 1 Set **/
#define HRTIM_TIMD_CPT1DCR_TA1SET		(1 << 12)
/** HRTIM_TIMD_CPT1DCR_EXEV10CPT External Event 10 Capture **/
#define HRTIM_TIMD_CPT1DCR_EXEV10CPT		(1 << 11)
/** HRTIM_TIMD_CPT1DCR_EXEV9CPT External Event 9 Capture **/
#define HRTIM_TIMD_CPT1DCR_EXEV9CPT		(1 << 10)
/** HRTIM_TIMD_CPT1DCR_EXEV8CPT External Event 8 Capture **/
#define HRTIM_TIMD_CPT1DCR_EXEV8CPT		(1 << 9)
/** HRTIM_TIMD_CPT1DCR_EXEV7CPT External Event 7 Capture **/
#define HRTIM_TIMD_CPT1DCR_EXEV7CPT		(1 << 8)
/** HRTIM_TIMD_CPT1DCR_EXEV6CPT External Event 6 Capture **/
#define HRTIM_TIMD_CPT1DCR_EXEV6CPT		(1 << 7)
/** HRTIM_TIMD_CPT1DCR_EXEV5CPT External Event 5 Capture **/
#define HRTIM_TIMD_CPT1DCR_EXEV5CPT		(1 << 6)
/** HRTIM_TIMD_CPT1DCR_EXEV4CPT External Event 4 Capture **/
#define HRTIM_TIMD_CPT1DCR_EXEV4CPT		(1 << 5)
/** HRTIM_TIMD_CPT1DCR_EXEV3CPT External Event 3 Capture **/
#define HRTIM_TIMD_CPT1DCR_EXEV3CPT		(1 << 4)
/** HRTIM_TIMD_CPT1DCR_EXEV2CPT External Event 2 Capture **/
#define HRTIM_TIMD_CPT1DCR_EXEV2CPT		(1 << 3)
/** HRTIM_TIMD_CPT1DCR_EXEV1CPT External Event 1 Capture **/
#define HRTIM_TIMD_CPT1DCR_EXEV1CPT		(1 << 2)
/** HRTIM_TIMD_CPT1DCR_UDPCPT Update Capture **/
#define HRTIM_TIMD_CPT1DCR_UDPCPT		(1 << 1)
/** HRTIM_TIMD_CPT1DCR_SWCPT Software Capture **/
#define HRTIM_TIMD_CPT1DCR_SWCPT		(1 << 0)

/**@}*/

